In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [4]:
dates = pd.date_range('20130101', periods=6, freq='M')

In [5]:
dates

DatetimeIndex(['2013-01-31', '2013-02-28', '2013-03-31', '2013-04-30',
               '2013-05-31', '2013-06-30'],
              dtype='datetime64[ns]', freq='M')

In [6]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = DataFrame(np.random.rand(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.400593  0.674068  0.102401  0.986068
2013-01-02  0.664359  0.848169  0.501480  0.164985
2013-01-03  0.845551  0.661169  0.677811  0.867622
2013-01-04  0.131808  0.569047  0.011856  0.450770
2013-01-05  0.259453  0.937804  0.593170  0.750442
2013-01-06  0.020937  0.636614  0.761457  0.058140

In [18]:
df2 = DataFrame({'A': 1.0, 
                 'B': pd.Timestamp('20130102'),
                 'C': Series(1, index=list(range(4)), dtype='float32'), 
                 'D': np.array([3] * 4,  dtype='int32'), 
                 'E': pd.Categorical(['test', 'train', 'test', 'train']), 
                 'F': 'foo'}, )
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
np.array([3] * 4)

array([3, 3, 3, 3])

In [21]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [26]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [31]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [32]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [35]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [36]:
df

                   A         B         C         D
2013-01-01  0.400593  0.674068  0.102401  0.986068
2013-01-02  0.664359  0.848169  0.501480  0.164985
2013-01-03  0.845551  0.661169  0.677811  0.867622
2013-01-04  0.131808  0.569047  0.011856  0.450770
2013-01-05  0.259453  0.937804  0.593170  0.750442
2013-01-06  0.020937  0.636614  0.761457  0.058140

In [37]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.400593    0.664359    0.845551    0.131808    0.259453    0.020937
B    0.674068    0.848169    0.661169    0.569047    0.937804    0.636614
C    0.102401    0.501480    0.677811    0.011856    0.593170    0.761457
D    0.986068    0.164985    0.867622    0.450770    0.750442    0.058140

In [43]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.986068  0.102401  0.674068  0.400593
2013-01-02  0.164985  0.501480  0.848169  0.664359
2013-01-03  0.867622  0.677811  0.661169  0.845551
2013-01-04  0.450770  0.011856  0.569047  0.131808
2013-01-05  0.750442  0.593170  0.937804  0.259453
2013-01-06  0.058140  0.761457  0.636614  0.020937

In [41]:
df.sort_values(by='D')

                   A         B         C         D
2013-01-06  0.020937  0.636614  0.761457  0.058140
2013-01-02  0.664359  0.848169  0.501480  0.164985
2013-01-04  0.131808  0.569047  0.011856  0.450770
2013-01-05  0.259453  0.937804  0.593170  0.750442
2013-01-03  0.845551  0.661169  0.677811  0.867622
2013-01-01  0.400593  0.674068  0.102401  0.986068

In [44]:
df['A']

2013-01-01    0.400593
2013-01-02    0.664359
2013-01-03    0.845551
2013-01-04    0.131808
2013-01-05    0.259453
2013-01-06    0.020937
Freq: D, Name: A, dtype: float64

In [45]:
df.A

2013-01-01    0.400593
2013-01-02    0.664359
2013-01-03    0.845551
2013-01-04    0.131808
2013-01-05    0.259453
2013-01-06    0.020937
Freq: D, Name: A, dtype: float64

In [46]:
df[0:3]

                   A         B         C         D
2013-01-01  0.400593  0.674068  0.102401  0.986068
2013-01-02  0.664359  0.848169  0.501480  0.164985
2013-01-03  0.845551  0.661169  0.677811  0.867622

In [47]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.664359  0.848169  0.501480  0.164985
2013-01-03  0.845551  0.661169  0.677811  0.867622
2013-01-04  0.131808  0.569047  0.011856  0.450770

In [48]:
 df.loc["2013-01-01"]

A    0.400593
B    0.674068
C    0.102401
D    0.986068
Name: 2013-01-01 00:00:00, dtype: float64

In [49]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.400593  0.674068
2013-01-02  0.664359  0.848169
2013-01-03  0.845551  0.661169
2013-01-04  0.131808  0.569047
2013-01-05  0.259453  0.937804
2013-01-06  0.020937  0.636614

In [51]:
df.iloc[:, 0:2]

                   A         B
2013-01-01  0.400593  0.674068
2013-01-02  0.664359  0.848169
2013-01-03  0.845551  0.661169
2013-01-04  0.131808  0.569047
2013-01-05  0.259453  0.937804
2013-01-06  0.020937  0.636614

In [52]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.664359  0.848169
2013-01-03  0.845551  0.661169
2013-01-04  0.131808  0.569047

In [53]:
df.iloc[1:4, 0:2]

                   A         B
2013-01-02  0.664359  0.848169
2013-01-03  0.845551  0.661169
2013-01-04  0.131808  0.569047

In [54]:
df.loc['20130102', ['A', 'B']]

A    0.664359
B    0.848169
Name: 2013-01-02 00:00:00, dtype: float64

In [55]:
df.iloc[1, 0:2]

A    0.664359
B    0.848169
Name: 2013-01-02 00:00:00, dtype: float64

In [57]:
df.loc[dates[0], 'A']

0.4005928796715126

In [58]:
df.iloc[0, 0]

0.4005928796715126

In [59]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})

In [61]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [66]:
df[df['float64'] >=5]

  string  int64  uint8  ...  bool2                      dates  category
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[2 rows x 8 columns]

In [68]:
df2 = df.copy()
df2

  string  int64  uint8  ...  bool2                      dates  category
0      a      1      3  ...  False 2022-04-12 12:48:53.607258         A
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]

In [70]:
df2['E'] = ['one', 'two', 'three']

In [71]:
df2

  string  int64  uint8  ...                      dates  category      E
0      a      1      3  ... 2022-04-12 12:48:53.607258         A    one
1      b      2      4  ... 2022-04-13 12:48:53.607258         B    two
2      c      3      5  ... 2022-04-14 12:48:53.607258         C  three

[3 rows x 9 columns]

In [75]:
df2[df2['E'].isin(['one', 'two'])]

  string  int64  uint8  float64  ...  bool2                      dates category    E
0      a      1      3      4.0  ...  False 2022-04-12 12:48:53.607258        A  one
1      b      2      4      5.0  ...   True 2022-04-13 12:48:53.607258        B  two

[2 rows x 9 columns]

In [76]:
df

  string  int64  uint8  ...  bool2                      dates  category
0      a      1      3  ...  False 2022-04-12 12:48:53.607258         A
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]

In [78]:
df.iat[0, 0] = 0
df

  string  int64  uint8  ...  bool2                      dates  category
0      0      1      3  ...  False 2022-04-12 12:48:53.607258         A
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]

In [80]:
df.iloc[0, 0] = 2
df

  string  int64  uint8  ...  bool2                      dates  category
0      2      1      3  ...  False 2022-04-12 12:48:53.607258         A
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]

In [82]:
df.at[0, 'float64'] = -20
df

  string  int64  uint8  ...  bool2                      dates  category
0      2      1      3  ...  False 2022-04-12 12:48:53.607258         A
1      b      2      4  ...   True 2022-04-13 12:48:53.607258         B
2      c      3      5  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]

In [83]:
df.loc[:, 'uint8'] = np.array([50] * len(df))
df

  string  int64  uint8  ...  bool2                      dates  category
0      2      1     50  ...  False 2022-04-12 12:48:53.607258         A
1      b      2     50  ...   True 2022-04-13 12:48:53.607258         B
2      c      3     50  ...  False 2022-04-14 12:48:53.607258         C

[3 rows x 8 columns]